# -*- coding: utf-8 -*-
from tests import HangulizeTestCase
from hangulize.langs.mkd import Macedonian


class MacedonianTestCase(HangulizeTestCase):

    lang = Macedonian()

    def test_people(self):
        self.assert_examples({
            # u'Методија Андонов-Ченто': u'메토디야 안도노프첸토',
            # => 메토디야 안도노브첸토
            'Димитрије Бужаровски': '디미트리예 부자로프스키',
            'Владо Бучковски': '블라도 부치코프스키',
            'Киро Глигоров': '키로 글리고로프',
            'Каролина Гочева': '카롤리나 고체바',
            'Никола Груевски': '니콜라 그루에프스키',
            'Димитар Димитров': '디미타르 디미트로프',
            'Партенија Зографски': '파르테니야 조그라프스키',
            'Ѓорге Иванов': '교르게 이바노프',
            'Милан Ивановиќ': '밀란 이바노비치',
            'Катарина Ивановска': '카타리나 이바노프스카',
            'Баже Илијоски': '바제 일리요스키',
            'Славко Јаневски': '슬라프코 야네프스키',
            'Борјан Јовановски': '보리안 요바노프스키',
            'Климент Охридски': '클리멘트 오흐리츠키',
            'Срѓан Керим': '스르잔 케림',
            'Никола Кљусев': '니콜라 클류세프',
            'Лазар Колишевски': '라자르 콜리셰프스키',
            'Блаже Конески': '블라제 코네스키',
            'Хари Костов': '하리 코스토프',
            'Жарко Кујунџиски': '자르코 쿠윤지스키',
            'Кирил Лазаров': '키릴 라자로프',
            'Венко Марковски': '벤코 마르코프스키',
            'Димитар Миладинов': '디미타르 밀라디노프',
            'Константин Миладинов': '콘스탄틴 밀라디노프',
            'Крсте Мисирков': '크르스테 미시르코프',
            'Петар Наумоски': '페타르 나우모스키',
            'Коле Неделковски': '콜레 네델코프스키',
            'Саша Огненовски': '사샤 오그네노프스키',
            'Горан Пандев': '고란 판데프',
            'Живко Поповски-Цветин': '지프코 포포프스키츠베틴',
            'Јулија Портјанко': '율리야 포르티안코',
            'Тоше Проески': '토셰 프로에스키',
            'Ѓорѓи Пулевски': '교르기 풀레프스키',
            'Кочо Рацин': '코초 라친',
            'Есма Реџепова': '에스마 레제포바',
            'Стевица Ристиќ': '스테비차 리스티치',
            'Душан Савиќ': '두샨 사비치',
            'Тодор Скаловски': '토도르 스칼로프스키',
            'Врбица Стефанов': '브르비차 스테파노프',
            'Горан Стефановски': '고란 스테파노프스키',
            'Борис Трајковски': '보리스 트라이코프스키',
            'Ѓорѓи Христов': '교르기 흐리스토프',
            'Бранко Црвенковски': '브란코 츠르벤코프스키',
            'Љубомир Цуцуловски': '류보미르 추출로프스키',
            'Коле Чашуле': '콜레 차슐레',
            'Живко Чинго': '지프코 친고',
            'Александар Џамбазов': '알렉산다르 잠바조프',
        })

    def test_places(self):
        self.assert_examples({
            'Битола': '비톨라',
            'Велес': '벨레스',
            'Гевгелија': '게브겔리야',
            'Гостивар': '고스티바르',
            'Кавадарци': '카바다르치',
            'Кичево': '키체보',
            'Кокино': '코키노',
            'Кораб': '코라프',
            'Кочани': '코차니',
            'Кратово': '크라토보',
            'Куклица': '쿠클리차',
            'Куманово': '쿠마노보',
            'Македонија': '마케도니야',
            'Маркови Кули': '마르코비 쿨리',
            'Нов Дојран': '노프 도이란',
            'Охрид': '오흐리트',
            'Прилеп': '프릴레프',
            'Радовиш': '라도비시',
            'Скопје': '스코피에',
            'Слатино': '슬라티노',
            'Струга': '스트루가',
            'Струмица': '스트루미차',
            'Тетово': '테토보',
            'Шар': '샤르',
            'Штип': '슈티프',
        })

    def test_miscellaneous(self):
        self.assert_examples({
            'Металург': '메탈루르크',
        })
